[
    {
        "company_name": "Microsoft",
        "title": "Senior Software Engineer",
        "span" : "06/2020 - present",
        "responsibilities" : [
            "Led feature teams for the creation of the new offerings of Microsoft Managed Desktop and Windows Autopatch.",
            "Developed and maintained many full-stack features writtin in C# and hosted in Azure.",
            "Led Security and Microservice v-teams to maintain and align security, architecture, and availability."
       ]
    },
    {
        "company_name": "C.H. Robinson",
        "title": "Software Engineer II",
        "span" : "04/2018 - 05/2020",
        "responsibilities" : [
            "Developed and maintained an industry leading Global Forwarding application.",
            "Created multiple websites using cutting edge front end technologies like React and Redux.",
            "Full stack design and maintainance of a 3 tiered, microservice based application.",
            "Led a study group focused on application performance, software design, technical skill, and software craftsmanship.",
        ]
    },
    {
        "company_name": "MCIS",
        "title": "Programmer/Analyst",
        "span" : "06/2015 - 04/2018",
        "responsibilities" : [
            "Developed a custom framework and platform using C#.Net for use in a cutting-edge EHR.",
            "Created an admin portal for EHR governance using WPF.",
            "Designed, maintained and improved security measures for a variety of enterprise applications, including integration of SSO via AD Federated Identity using OAuth 2 and OpenID Connect.",
            "Produced an API for healthcare applications, using ASP.NET Web API and ASP.Net Core MVC.",
            "Implemented an enterprise level messaging and eventing systems via Microsoft Azure.",
        ]
    },
    {
        "company_name": "MCIS",
        "title": "Programmer/Analyst Intern",
        "span" : "05/2014 - 09/2014",
        "responsibilities" : [
            "Created a cross platform Android/iOS app for clinic patients using Xamarin.",
            "Designed back-end API hosted on Microsoft Azure.",
            "Contributed to a DDD focus design.",
            "Produced a backing data store using Microsoft SQL Server hosted on Azure.",
        ]
    },
    {
        "company_name": "Menards",
        "title": "Mobile Development Intern",
        "span" : "12/2012 - 01/2014",
        "responsibilities" : [
            "Developed the publically available Menards application for both iOS and Android.",
            "Created multiple enterprise level Android applications used by store employees.",
            "Participated in all phases of development including designing, testing, deployment, and analytics gathering.",
        ]
    }
]
